In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
pd.DataFrame(dict1)

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [3]:
data1=pd.DataFrame(dict1)
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [4]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [5]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [6]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [7]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,'Hyd','Mumbai','Chennai']}
pd.DataFrame(dict2)

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [8]:
data2=pd.DataFrame(dict2)
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [9]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [10]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','Chennai']}
pd.DataFrame(dict3)

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

**Method-1**

>Fill the missing values with random number

dataframe name=data1

method name : fillna

In [11]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

In [12]:
**Method-2**

>Fill the missing values with random numbers on specific columns

dataframe name=data1

method name : fillna

SyntaxError: invalid syntax (955817765.py, line 1)

In [13]:
data1['Names'].fillna('Sathish',inplace=True)
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  Chennai

In [14]:
#create data again
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

**Method-3**

- backfill

- bfill

- ffill

- pad

In [15]:
data1.fillna(method='backfill')
# Names index 2 has missed value
#       it will replace by index 3 value
# Age   index 3 has missed value
#       we dont have index 4,so the value is NaN
#City  index 0 has missed value
#      it replace with index 1 value

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [16]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [17]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [18]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

**Method - 4**

- mean

- median

- mode

In [19]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [20]:
# instead of providing a random number
# we are filling with mean of the data
age_mean=data1['Age'].mean()
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [21]:
age_median=data1['Age'].median()
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

**Method -5**
- KNN imputer

KNN : k nearest neighbours
    
- in the KNN imputer instead of taking mean of all the values

- will choose neighbours data

- will take those mean only

**KNN imputer**

In [23]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1['age'])

KeyError: 'age'

In [26]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
a=knn.fit_transform(data1[['Age']])

In [28]:
data1['Age']=a
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh  32.0  Chennai

In [ ]:
** method - 6**